{
  "home": "Accueil",
  "about": "À propos",
  "operations": "Opérations",
  "contact": "Contact",
  "callUs": "Appelez-nous",
  "aboutTitle": "À propos de MAGA Energy Ltd.",
  "aboutSubtitle": "Fondé sur l'innovation, l'intégrité et la performance.",
  "aboutText": "• MAGA Energy Ltd. (Make Alberta Great Again) est une société privée de production de pétrole et de gaz basée à Calgary, Alberta, avec 20 employés et entrepreneurs dédiés. La production totale actuelle est d'environ 1800 BOE/jour avec une répartition de 55%/45% entre le gaz naturel et les liquides. MAGA possède environ 350 puits dont 80 sont en production. La position foncière de MAGA comprend 100 sections ou 64 000 acres (260 KM2), dont la majorité avec une participation de 100%. L'activité de MAGA commence par un examen minutieux du potentiel géologique de chaque puits et un développement planifié pour maximiser les ressources de pétrole léger à moyen et de gaz naturel de toutes les zones géologiques. MAGA réutilise et recycle les équipements et baux existants sur les puits, minimisant ainsi l'impact environnemental en réduisant l'empreinte au sol. MAGA inclut également la production d'électricité à partir de générateurs à gaz naturel à haut rendement. L'entreprise vise à capter le dioxyde de carbone de sa production d'électricité pour la récupération assistée du pétrole, atteignant ainsi un nouveau standard d'intensité d'émissions pour la production d'énergie et de ressources pétrolières. Les zones principales de MAGA sont à l'ouest et au nord d'Edmonton, incluant Acheson, Spruce Grove, Golden Spike, St. Albert, Campbell-Morinville et Westlock. En raison de la proximité de nos opérations avec les zones urbaines, MAGA s'engage à être un gestionnaire responsable dans notre région d'opération. L'entreprise est guidée par des décisions qui soutiennent notre solide bilan et minimisent notre empreinte environnementale tout en prenant des décisions économiques judicieuses. Les projets récents incluent la remise en état de sites en collaboration avec les propriétaires fonciers locaux et les promoteurs, en utilisant le programme de réhabilitation des sites du gouvernement de l'Alberta pour compléter les dépenses. L'équipe de direction de MAGA a une mentalité et une stratégie différentes pour la croissance future. La première priorité est de reprendre la production des puits fermés et de développer le potentiel de pétrole et de gaz non exploité. Les puits sans potentiel économique seront abandonnés dès que possible afin que les propriétaires fonciers puissent poursuivre leurs projets. MAGA travaille sur plusieurs projets de production d'électricité à partir de gaz qui alimentent des centres de données sur site et récupèrent la chaleur et le CO2 pour d'éventuels opérateurs de serres locaux. Cet effort profitera aux communautés locales en créant plus d'emplois et d'opportunités tout en réduisant l'empreinte carbone des opérations de l'entreprise.",
  "leadership": "Notre direction",

  "leaderBiagioTitle": "Président",
  "leaderBiagioDesc": "Biagio Mele, P. Eng. Président\nProfessionnel chevronné de l'énergie avec un esprit entrepreneurial, passionné et créatif. Plus de 30 ans d'expérience en leadership, exploitation, acquisition et ingénierie des réservoirs pour des grandes et petites entreprises. Fondateur et leader de Blaze Energy en 1995, une société pétrolière et gazière privée de premier plan, transformée en une entreprise possédant un portefeuille d'actifs midstream, upstream et de stockage de gaz dans le bassin sédimentaire de l'Ouest canadien. A réalisé des acquisitions totalisant 163 millions de dollars canadiens et des cessions totalisant 316 millions de dollars canadiens, illustrant une capacité à identifier, négocier, conclure et intégrer avec succès des actifs. Expérience antérieure chez Dome, Opinac, Cimarron, Northern Reef et Berkley Petroleum.",

  "leaderMarkTitle": "Vice-président, Opérations sur le terrain",
  "leaderMarkDesc": "Mark Ross, P. Eng. - V.P. Opérations\nM. Ross possède plus de 30 ans d'expérience en ingénierie des opérations, ayant débuté chez Mobil Oil en 1981 et travaillé dans divers endroits tels que Rainbow Lake, SE Sask., et Drayton Valley, en tant qu'ingénieur de production jusqu'en 1992. Mark a ensuite fondé Ross Energy Services, axée sur le conseil en forage et complétion de puits pour les petites sociétés pétrolières jusqu'en 2015. Il a joué un rôle clé dans la croissance de Houston Oil & Gas Ltd. de 150 à 3000 BOE/j entre 2015 et 2017 grâce à des acquisitions d'actifs en difficulté et à l'optimisation. Mark a cofondé Darkhorse Oil & Gas et Longbow Energy.",

  "leaderDavidTitle": "Directeur chez MAGA Energy Ltd.",
  "leaderDavidDesc": "David Tian, M. Sc., Géologue - V.P. Exploitation\nPlus de 30 ans d'expérience en géologie pétrolière et 20 ans d'expérience en gestion. Excellente expertise et taux de réussite économique de plus de 85 % dans l'exploitation de couches non exploitées. Cofondateur de Canflame Energy, Darkhorse Oil & Gas et Canstar Energy, qui a réalisé un rendement net de 400 % en 18 mois. Expérience antérieure en exploration et géologie chez CNPC Canada & Bearspaw Petroleum, dont le coût de découverte et de développement n'est que de 10 % de la moyenne de l'industrie et qui a fait passer la société de 1 500 à 4 000 BOE/j entre 1997 et 2002 grâce à l'exploitation de couches non exploitées. Délai de récupération record de 10 jours et le meilleur puits de pétrole foré a atteint 1 MMB de pétrole cumulé.",

  "leaderPatrickTitle": "Directeur financier (CFO)",
  "leaderPatrickDesc": "Patrick Amantea, CFO\nM. Amantea est un expert-comptable agréé avec une expérience diversifiée dans le secteur pétrolier et gazier. 15 ans d'expérience en reporting financier et opérationnel, IFRS, budgétisation et prévisions, gestion d'équipe, contrôles internes, comptabilité complète et services de conseil aux entreprises. Patrick a travaillé pour des sociétés privées et publiques ; il a occupé des postes à responsabilités croissantes, notamment en reporting financier, comptabilité de coentreprise, revue de la comptabilité de production, ressources humaines, gestion des risques, gestion informatique, conseil en fusions et acquisitions, comptes fournisseurs et comptabilité des systèmes.",

  "heroTitle": "Maga Energy Ltd.",
  "heroSubtitle": "Alimenter l'avenir énergétique de l'Alberta avec précision et intégrité.",
  "innovationTitle": "Innovation",
  "innovationDesc": "Nous utilisons des technologies modernes pour améliorer l'efficacité sur le terrain, réduire les émissions et rationaliser les opérations.",
  "sustainabilityTitle": "Durabilité",
  "sustainabilityDesc": "Engagés dans un développement énergétique responsable qui respecte la terre et les communautés locales.",
  "efficiencyTitle": "Efficacité",
  "efficiencyDesc": "Des opérations allégées avec une production maximale, la sécurité et la conformité réglementaire.",
  
  "operationsTitle": "Nos opérations",
  "operationsIntro": "Nos opérations couvrent la production de pétrole, l'extraction de gaz naturel et le minage de Bitcoin. Nous exploitons des technologies innovantes et des pratiques efficaces pour fournir de l'énergie et des actifs numériques, en combinant parfois ces activités sur le même site pour une utilisation optimale des ressources.",
  "westlockDesc": "Le champ pétrolier et gazier de Westlock, situé dans le centre de l'Alberta, est un site de production conventionnelle de pétrole et de gaz naturel. En 2022, le champ avait une production cumulative de pétrole d'environ 0,34 million de barils et de gaz d'environ 15 835 millions de mètres cubes. Les réserves restantes étaient estimées à 0,1 million de barils de pétrole et 345 millions de mètres cubes de gaz.",
  "stAlbertDesc": "St. Albert, Campbell et Morinville : Ces communautés dynamiques sont au cœur du corridor énergétique de l'Alberta. Nos opérations ici se concentrent sur des techniques d'extraction innovantes, l'engagement communautaire et la gestion durable des ressources. La région est reconnue pour son esprit de collaboration et son approche avant-gardiste du développement énergétique.",
  "ghostpineDesc": "",
  "achesonDesc": "Acheson et Golden Spike : Ce groupe de champs représente un mélange dynamique de sites pétroliers historiques et de nouveaux développements. Nos équipes utilisent des technologies avancées et des décennies d'expertise pour maximiser la production tout en minimisant l'impact environnemental. Ces zones témoignent du leadership continu de l'Alberta dans le secteur de l'énergie.",
  "pembinaDesc": "Pembina et Berrymoor : Le champ de Pembina est l'une des plus anciennes et des plus prolifiques régions productrices de pétrole de l'Alberta, connue pour sa contribution significative au secteur énergétique de la province depuis les années 1950. Berrymoor est un champ plus petit et établi avec une histoire de production conventionnelle de pétrole et de gaz, soutenant l'industrie et les communautés locales.",
  "berrymoorDesc": "",
  "tofieldDesc": "Tofield : Situé au centre de l'Alberta, Tofield a une histoire de développement pétrolier et gazier soutenant le secteur énergétique de la région. La zone a connu à la fois une production conventionnelle et l'application de nouvelles technologies, contribuant à la croissance de l'industrie et de la communauté locale.",
  
  "contactTitle": "Contactez-nous",
  "name": "Nom",
  "email": "E-mail",
  "message": "Message",
  "send": "Envoyer le message",
  "confirmation": "Le client de messagerie s'est ouvert. Vous pouvez maintenant envoyer votre message.",
  "phone": "Téléphone",
  "emailLabel": "E-mail",
  "emergency": "Numéro d'urgence 24h/24",
  "placeholderName": "Votre nom complet",
  "placeholderMessage": "Tapez votre message ici...",
  "btcMining": "Minage de Bitcoin",
  "oil": "Pétrole",
  "gas": "Gaz",
  "miniWestlockInfo": "Westlock & Acheson : Production d'environ 6 MMCF/jour (170 e3m3/jour) de gaz.",
  "miniStAlbertInfo": "St. Albert/Morinville : 7 MMCF/jour (198 e3m3/jour) de gaz actuellement à l'arrêt. Potentiel de production électrique de 80 à 100 MW.",
  "miniAchesonInfo": "Acheson : 800 MCF/jour de gaz fournis à l'installation minière Campbell de 5 MW.",
  "miniPembinaInfo": "Région de Pembina : Pas de données de production disponibles actuellement.",
  "miniTofieldInfo": "Tofield : Pas de données de production disponibles actuellement.",
  "businessOpportunitiesTitle": "Opportunités d'affaires",
  "g2pTitle": "Opportunités G2P pour centres de données/IA/minage de cryptomonnaies :",
  "g2pText": "Actuellement, MAGA Energy dispose de 8 MWh de G2P en fonctionnement pour ses partenaires de minage BTC et a récemment obtenu un permis supplémentaire de 9 MWh de la part de l'AUC. MAGA dispose d'importantes capacités de gaz naturel non exploitées et invite les parties intéressées à discuter de futures opportunités d'affaires.",
  "resourcesTitle": "Développement des ressources :",
  "resourcesText1": "MAGA possède 135 000 acres (540 km2) de concessions de pétrole et de gaz naturel, avec près de 300 millions de barils de pétrole en place (OOIP), dont la plupart sont des huiles légères à moyennes prouvées par des données de puits verticaux existants et ignorées par les opérateurs précédents. Les nouvelles technologies telles que les puits horizontaux + fracturation multistade ou les puits horizontaux multilatéraux augmenteront considérablement la production et les réserves récupérables, créant ainsi un retour économique solide pour les investisseurs.",
  "resourcesText2": "MAGA recherche activement des partenaires potentiels pour des coentreprises de développement des ressources et la création d'opportunités gagnant-gagnant.",
  "businessOpportunitiesMain": "Opportunités d'affaires",
  "g2pMain": "G2P pour centres de données/IA/minage de cryptomonnaies :\nActuellement, MAGA Energy dispose de 8 MWh de G2P en fonctionnement pour ses partenaires de minage BTC et a récemment obtenu un permis supplémentaire de 9 MWh de la part de l'AUC. MAGA dispose d'importantes capacités de gaz naturel non exploitées et invite les parties intéressées à discuter de futures opportunités d'affaires.",
  "resourcesMain": "Développement des ressources :\nMAGA possède 135 000 acres (540 km2) de concessions de pétrole et de gaz naturel, avec près de 300 millions de barils de pétrole en place (OOIP), dont la plupart sont des huiles légères à moyennes prouvées par des données de puits verticaux existants et ignorées par les opérateurs précédents. Les nouvelles technologies telles que les puits horizontaux + fracturation multistade ou les puits horizontaux multilatéraux augmenteront considérablement la production et les réserves récupérables, créant ainsi un retour économique solide pour les investisseurs.\nMAGA recherche activement des partenaires potentiels pour des coentreprises de développement des ressources et la création d'opportunités gagnant-gagnant.",
  "opportunities": "Opportunités"
}
